Autodesk.Revit.DB.PropertySetElement.SetEmbodiedCarbonAsset(Autodesk.Revit.DB.EmbodiedCarbonAsset)
Sets a copy of the given EmbodiedCarbonAsset to be used in the PropertySetElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the name of the asset is empty, contains prohibited characters, or is not unique
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.PropertySetElement.GetEmbodiedCarbonAsset
Gets a copy of the EmbodiedCarbonAsset.
Since:
2012

Autodesk.Revit.DB.PropertySetElement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.EmbodiedCarbonAsset)
Creates a new PropertySetElement to contain the given asset.
document:
The document in which to create the PropertySetElement.
embodiedCarbonAsset:
The embodied carbon asset containing the values that will be present in the PropertySetElement.
Returns:
The new PropertySetElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the name of the asset is empty, contains prohibited characters, or is not unique
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027